print("โปรแกรมการใช้เงิน")
money = 1000
print("มีงบอยู่",money,"บาท")
print("เลือกสินค้าจำนวน 15 อย่าง")

หมูสับกิโล = 150
เนื้ออกไก่ = 105
ไก่บ้าน = 120
มาม่าต้มยำ = 6.5
ข้าวสาร = 150
น้ำตาล = 20
ปลากระป๋องสามแม่ครัว = 10
ซอสน้ำมันหอย = 18
ผงชูรส = 10.25
ไข่แผงคละเบอร์ = 120.25
ชาเขียว = 21.5
pepsi = 29.5
กาแฟ = 15.75
ขนมปังอบเนย = 19
ชาไทย = 11.5
น้ำเปล่า = 15.15
น้ำแข็ง = 10

Total = (หมูสับกิโล+เนื้ออกไก่+ไก่บ้าน+ข้าวสาร+น้ำตาล+ซอสน้ำมันหอย+ไข่แผงคละเบอร์+ชาเขียว+pepsi+กาแฟ+ขนมปังอบเนย+ชาไทย+น้ำเปล่า+น้ำแข็ง+ปลากระป๋องสามแม่ครัว+ผงชูรส)

change = money - Total

print("ยอดรวมค่าใช้จ่าย:", Total,"บาท")
print("เงินทอนจำนวน:", change,"บาท")